In [76]:
%load_ext sql
## %sql indicates that specific line is in SQL, everything else is python
## %%sql means the entire cell is SQL
## -- generally refers to a comment, except in certain instances such as --persist

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [75]:
%%sql sqlite:// 
DROP TABLE IF EXISTS Student;
CREATE TABLE Student(
        Student_ID INTEGER NOT NULL,
        First_Name TEXT NOT NULL,
        Last_Name TEXT,
        Scabbyness REAL 
);
SELECT * FROM Student -- create basic table for experiment purposes

Done.
Done.
Done.

[]

In [31]:
%%sql
INSERT INTO Student -- inserting values into table
VALUES
    (1,"John", "S", 0.12),
    (2, "Matt", "S", 1 ),
    (3,"John", "K", 1);

 * sqlite://
3 rows affected.

[]

In [32]:
%%sql 
SELECT *
FROM Student
GROUP BY Student_ID
HAVING First_Name = "John" AND Scabbyness = "1" -- filtering based on multiple variables

 * sqlite://
Done.

[(3, 'John', 'K', 1.0)]

In [33]:
%%sql 
DROP TABLE IF EXISTS Scabs; --drop table if exists
CREATE TABLE Scabs (Student_ID INTEGER NOT NULL, -- create table
        First_Name TEXT NOT NULL,
        Last_Name TEXT,
        Scabbyness REAL 
);

INSERT INTO Scabs ( Student_ID, First_Name ) -- inserting values into new table from old table based on filter
SELECT Student_ID, First_Name
FROM Student
GROUP BY Student_ID
HAVING Scabbyness > .5

 * sqlite://
Done.
Done.
2 rows affected.

[]

In [130]:
%%sql 
SELECT Student_ID, First_Name --print off table
FROM Scabs
ORDER BY Student_ID DESC

 * sqlite://
Done.

[(3, 'John'), (2, 'Matt')]

In [74]:
## turning SQL table into dataframe
results = %sql SELECT * FROM Student WHERE ("Student_ID" % 2) = 0 OR ("Student_ID" % 3) = 0
dataframe = results.DataFrame()
results

 * sqlite://
Done.

[(2, 'Matt', 'S', 1.0), (3, 'John', 'K', 1.0)]

In [68]:
## Dataframe to SQL table
bent = pd.read_csv('C:/Users/Julius/Downloads/Aus_elections/bentleighdistrict.csv')
wanted1 = bent['Total_Votes_Polled']
wanted2 = bent['ALP_Approx_%']
State_results = pd.DataFrame(
    {'ALP_percent': wanted2,
        'Votes': wanted1,
    })
State_results ## created DF

%sql --persist State_results

 * sqlite://

'Persisted state_results'

In [71]:
# Pulling up SQL table created from Pandas dataframe
%sql SELECT ALP_percent, Votes FROM State_results ORDER BY Votes DESC

 * sqlite://
Done.

[(0.6186919946, 39129.0),
 (0.6445773624000001, 20492.0),
 (0.590349062, 18637.0),
 (0.6004891684, 12071.0),
 (0.5399298154, 4077.0),
 (0.6213653484, 2308.0),
 (0.6641542056, 2273.0),
 (0.6499744507, 2071.0),
 (0.6202282158, 2027.0),
 (0.6646990741, 1825.0),
 (0.6229604366, 1582.0),
 (0.6333837689, 1545.0),
 (0.6051362683, 1508.0),
 (0.6573749094, 1490.0),
 (0.6553599374, 1348.0),
 (0.6479886147999999, 1140.0),
 (0.6438668099, 988.0),
 (0.6572467222999999, 895.0),
 (0.632968254, 679.0),
 (0.6818566176, 590.0),
 (0.6568862275, 531.0),
 (0.6605263158, 181.0),
 (None, None)]